{
  "gannaca": "Strategic Operator & Systems Architect – gannaca GmbH (June 2023 – Present)\n\n- Worked closely with the founder to manage and execute across a hybrid role spanning strategic thinking, process design, and digital implementation.\n- Spearheaded the operational design and tech stack for gannaca’s AI-driven transformation service.\n- Owned automation flows for business-critical processes using no-code platforms.\n- Served as the internal product owner across website relaunches, service design, and go-to-market strategy.\n- Integrated SEO and UX principles across multiple touchpoints including CMS architecture.\n- Coordinated creative and operational workflows with a visionary founder, ensuring clarity and consistency under pressure.\n- Shaped go-to-market planning through strategic segmentation and brand positioning.",

  "ingram": "Platform Success Representative EMEA – Ingram Micro Cloud (May 2022 – Feb 2023)\n\n- Drove client adoption of marketplace solutions by translating technical requirements into tailored onboarding and integration workflows.\n- Enabled long-term customer adoption of cloud marketplace offerings through onboarding and workflow support.\n- Interpreted technical limitations and business goals to drive better integration experiences for clients.\n- Synthesized customer input into actionable insights for cross-functional product teams.\n- Supported internal alignment across global and local success, support, and engineering units.",

  "cancom": "Operations and Onboarding Specialist – Marketplace – CANCOM GmbH (Feb 2020 – May 2022)\n\n- Oversaw operational flows and customer onboarding for CANCOM’s marketplace platform, ensuring seamless partner integration and internal coordination.\n- Orchestrated partner onboarding flows, from API setup to CRM integration and ecosystem access.\n- Resolved edge-case technical and process challenges through cross-team coordination.\n- Managed documentation strategy, partner enablement materials, and internal onboarding frameworks.\n- Functioned as a central link between commercial, operational, and technical teams.",

  "covestro": "Order Manager – Covestro GmbH (May 2015 – Aug 2019)\n\n- Facilitated international order fulfillment processes for key accounts in the chemical industry, ensuring precision, compliance, and customer satisfaction.\n- Monitored European B2B supply chain inquiries, quality assurance, and documentation workflows.\n- Maintained CRM data integrity and supported SAP integration efforts to streamline operational processes.\n- Led initiatives to align internal documentation with compliance, legal, and customer requirements.\n- Liaised with logistics providers and internal stakeholders to meet SLAs.",

  "education": "Bachelor of Arts in Foreign Languages (English and German) – Spiru Haret University, Bucharest (2004–2008)",

  "skills": "Strategic Operations & Internal Communications; AI-Integrated Outreach Systems; Process Automation and Digital Infrastructure; Cross-functional Project Execution; Creative Content Architecture; Stakeholder and Change Management",

  "tools": "Automation & CRM: Make.com, HubSpot, Google Sheets, Typeform\nAI & Content: ChatGPT, GPT Builder, ElevenLabs, Midjourney, HeyGen\nDesign & Prototyping: Figma, Canva, Adobe XD, Framer\nWeb (basic): HTML, CSS, JavaScript\nProject & Ops: Jira, Trello, SAP, Zendesk\nAnalytics & SEO: Google Search Console, on-page SEO, CTA strategy",

  "languages": "Romanian (native), English (fluent), German (proficient)",

  "certifications": "Lean Six Sigma Yellow Belt; Supply Chain Academy – Foundational Training; Supply Chain Academy – Inventory Management; Web Development Bootcamp – neue fische (2019)",

  "early": "Early Experience & Voluntary Roles (2008–2014)\n\n- Office Assistant, Fashion Retail Group (2012–2014)\n- EVS Volunteer / English Assistant, CNC Osijek, Croatia (2011–2012)\n- Sales Advisor, Diverta SA (2008–2011)"
}

